
import { InvigilatorData } from '../types.ts';

// FIX: Removed extra closing parenthesis from several header strings (e.g., "2025-10-27 (9:00-10:00-صباحا))" became "2025-10-27 (9:00-10:00-صباحا)") for data consistency.
export const headers: string[] = [
    "2025-10-26 (9:00-10:00-صباحا)", "2025-10-26 (11:30-12:30-مساء)", "2025-10-26(4:00-5:00-مساء)", "2025-10-26(5:30-6:30-مساء)",
    "2025-10-27 (9:00-10:00-صباحا)", "2025-10-27 (11:30-12:30-مساء)", "2025-10-27(4:00-5:00-مساء)", "2025-10-27(5:30-6:30-مساء)",
    "2025-10-28 (9:00-10:00-صباحا)", "2025-10-28 (11:30-12:30-مساء)", "2025-10-28(4:00-5:00-مساء)", "2025-10-28(5:30-6:30-مساء)",
    "2025-10-29 (9:00-10:00-صباحا)", "2025-10-29 (11:30-12:30-مساء)", "2025-10-29(4:00-5:00-مساء)", "2025-10-29(5:30-6:30-مساء)",
    "2025-10-30 (9:00-10:00-صباحا)", "2025-10-30 (11:30-12:30-مساء)", "2025-10-30(4:00-5:00-مساء)", "2025-10-30(5:30-6:30-مساء)",
    "2025-11-02 (9:00-10:00-صباحا)", "2025-11-02 (11:30-12:30-مساء)", "2025-11-02(4:00-5:00-مساء)", "2025-11-02(5:30-6:30-مساء)",
    "2025-11-03 (9:00-10:00-صباحا)", "2025-11-03 (11:30-12:30-مساء)", "2025-11-03(4:00-5:00-مساء)", "2025-11-03(5:30-6:30-مساء)",
    "2025-11-04 (9:00-10:00-صباحا)", "2025-11-04 (11:30-12:30-مساء)", "2025-11-04(4:00-5:00-مساء)", "2025-11-04(5:30-6:30-مساء)",
    "2025-11-05 (9:00-10:00-صباحا)", "2025-11-05 (11:30-12:30-مساء)", "2025-11-05(4:00-5:00-مساء)", "2025-11-05(5:30-6:30-مساء)",
    "2025-11-06 (9:00-10:00-صباحا)", "2025-11-06(4:00-5:00-مساء)"
];

const rawData = `
أسماء ابراهيم عبدالعزيز عامر	A7				A7	A7			A7			D8	A7	A7			H6					B6			A7		C6		A7				A7		C7		A7	
أمال هاشم محمد	A7		D7		A7	A7			A7		C6		A7	A7			H8					B6	C7							A7	C7		A7	A7				
أماني لطفي أحمد عمارة	A8		C7		A8	A7			A7				A8	A7	F10		A7		D8			B6			A7				A7				A8	A7				
أميرة مصطفى فهمي اسماعيل	A8				A8	A8			A8				A8	A8			A7	A7				B7			A7		C8		A7		C6		A8	A7				
أنفال ساير مرحول الرويلي	B1				B1	A8			A8				B6	A8			A7					B7			A8				A8		D5	D6	B3	A8			A7	
إدلينا سانتوس	B1				B1	A8			A8				B6	A8			A8					B7			A8				A8		C8		B3	A8			A7	C6
إيمان مختار محمد جبر	B2				B2	B6			B6			D7	B7	B6		F7	A8					B8									D4	D6	B6					D6
اسماء عبدالله احمد حسين	B2		D7		B2	B6			B6				B7	B6			A8					B8	B8		A8				A8				B6	A8				D7
اشراقه عبيد محمد صالح	B3				B3	B6	D5		B6				B8	B6	F9		B6					B8			B6				B6				B7	B6				
ايمان محمد محمد ابوبكر	B3				B3	B7	D6		B7				B8	B7		F7	B6					C6	C7		B6								B7	B6	D8			
بتعة محمود محمد إسماعيل	B6				B6	B7			B7			D8	C2	B7			B7					C6	C6		B6				B6				B8	B6			A8	
براء طعمة ابوالسل	B6				B6	B7			B7				C2	B7		F7	B7			D7		C6		B7	B7				B6	A7			B8					
جيهان احمد البهلوان	B7				B7	B8			B8		C7		C6	B8			B7					C7	C6		B7				B7			C9	C2	B7				
داليا محمد فتحي عبد المقصود	B7				B7	B8			B8				C6	B8			B8					C7			B7				B7	A7	D5		C2	B7	D8			
رانيا عبد الخالق جودة الحسين	B8				B8	B8			B8				C7	B8			B8	A7				C7			B8				B7	A8			C6	B7			A8	
رشا عبدالحليم  القاضي	B8	A7			B8	C2			C6				C7	D6			C6					C8			B8				C7	A8			C6	B8			A8	
رولا حسن محمد ازهري	C6		D7		C2	C2			C7				C8	D6			C7	A7				C8			C6				C7				C7	B8				
ريم علي حوفان الشمراني	C7	A7			C6	C6			C7	A7			C9	D7			C7	A8																				
زينب ربيع عبد المرضي	C7				C6	C6			C7			D7	C9	D7			C7					C9			C6		F9		C8				C8	C6				C9
سارة رويشد خويتيم العنزي	C8				C7	C6			C8	A7			D4	D7			C8	A8				C9			C7		C9	A7	C8				C8					
سلوي محمد جميل  الوفائي	C8	A7			C7	F10			C8				D4	D8			C8	A8				C9			C7					C6			C9				C6	C8
سهام شحاته مصطفى مرزوق	D1	A8			C8	F10	D5		C8				D6	D8		A7	C9					D6			C7					C6			C9				C6	
سيرلي أجنود	D1		D8		C8	F10			C9				D6	D8			C9	B6				D6			C8	C7				C6			D4				C7	
شهد زياد علي الدندن	D4				C9	F8	D7		C9				D7				D6	B6				D6			C8	C7	C6			C7			D4				C7	
ضحى عبد الهادي  محمد	D4				C9	F8	D5		C9	A7			D7				D6	B6	D8	D7		D8			C8	C7							D5					
عايدة أحمد محمد إبراهيم	D5				D5	F8	D6		D5	A8			D8				D7	B7		D7	A7				C9		C7						D5					D6
غادة صبحي حسن	D5				D5	F9			D5	A8			D8				D7	B7			A7			B7	C9					C7			D6	C6				D7
فاتن فتحى أحمد محفوظ	D6				D6	F9			D6	A8			E10		F9		E6	B7			A7				C9		C7						D6	C6				C8
لمياء عبد الحكيم على غراب	D6		D8		D6				D6	B6			E10				E6	B8			A8				E10		F9			C7			D7	C7			C7	
مآثر جدعان عبدالحمن الجديع	D7				D7				D6	B6			E6		F9		E8	B8			A8				E10			F10		C8			D7				C8	C9
مثايل فهد مبارك الشمري	D7				D7				D7	B6			E6				E8	B8		D6	A8	D8			E10	C8				C8			D8	C7				
ملاك محمد يحيى يعقوب	D8				D8				D7	B7			E8			A8	E9	C6			B6				E9	C8				C8			D8	C7			C8	
منال سلطان مداد الرويلي	D8				D8				D7	B7			E8				E9	C6			B6				E9	C9				C9			E6	C9			C8	D7
منال محمد أحمد عبدالعزيز	E10	A8			E10				D8	B7			E9			A8	F10	C6			B6				E9			F10		C9		D6	E6					
منى تيمان إدريس قصب	E10	A8			E10				D8	B8			E9				F10	C7			B7				F10	C10		D4		C9		D7	E8					
مها ابراهيم فؤاد العشري فودة	E6				E6				D8	B8			F2				F10	C7			B7				F10	C11				D6	C7		E8				C9	C6
نجود عواد عودة العطوى	E6				E6				F10	B8			F2				F6	C7	C8		B7				F10	C12				D6	C6	D7	E9					
ندى صقر حويل الرويلي	E8				E8				F10	D6			F5			A8	F6	D6	D8		D6				F6	C13				D6			E9				C9	
نرجس محمد محمد صيام	E8				E8				F10	D6			F5			A8	F7	D6	C9		D6		B8		F6	C14							F6				C9	
نعيمة محمد السيد احمد	E9				E9		D7		F8	D6			F6				F7	D6			D6				F6	C15	C8	D5				C9	F6					
هبة أحمد عبدالمعطي	E9				E9		D7		F8	D7			F6				F8	D7		D6	D7		B8		F7	C16							F7				D6	
هدايا إسماعيل أبو bكر إسماعيل	F8				F1		D8		F8				F7				F8	D7			D7				F7	C17	C9		C8	D7			F7				D6	
هدي محمد عبد الرحمن فليفل	F8				F1		D8		F9				F7		F10		F9	D7		C6	D7				F7	C18						C8	F8				D6	
هند ابو السعود أحمد الصعيدي	F9				F10				F9	D7			F8		C8		F9	D8			D8				F8	C19			C9	D7			F8				D7	
هويدا محمد علي حسن			C9									D7			C9	A7		D8		D6	D8	D8		B7	F8	C8			C9	D7			F9	C9			D7	
ياسمين سالم دراق	F9				F10	F9			F9	D7			F8				F9	D8			D8				F8				C9		D4		F9	C9			D7	
نبيلة سالم محمد سالم					F2																																	
نهيد الخطيب					F2																																	
إدارية 1					F5																																	
إدارية 2					F5																																	
إدارية3					F6																																	
إدارية 4					F6																																	
إدارية 5					F9																																	
إدارية 6					F9																																	
إدارية 7	C6				C2								C8				C6																C7					
أحمد جمال الدين محمد	G1				G1				G1	G1			G1		C6		G3	G1				G1			G5	G1			G1				G1		C7		G1	
أحمد محمد وهبة السيد	G1		C7		G1				G1	G1			G1	G1		A7	G3			C7		G1			G5								G1	G1			G1	
أشرف أمين  الطحان	G2				G2				G2	G1			G2	G1	C8		G4	G1			G1				G5	G1							G3	G1			G2	
ابراهيم احمد محمد السماحي	G2		C8		G2				G2	G3			G2		C7		G4	G1		C6					G6							C8	G3	G2			G2	
بشارة إلياس حمدتو	G3				G3		C7		G6	G3			G5		C6		G5	G2										A7	G1	G1			G4	G2			G3	
دانيال جوزيف إسبينا	G3				G3	G1			G6	G3			G5	G1			G5	G2			G1				G6				G1				G4	G4			G3	
سلطان عيادة ثاني الشمري	G6				G4				G7	G4		C9	G6	G2			G6	G2							G6			A7		G1			G5				G4	C6
سمير هاشم هاشم خليفة	G6				G4	G1			G7	G4			G6	G2			G6	G3			G1	G1			G7				G2	G1			G5				G4	
عبد القادر الأمين الأمين	G7		C9		G5	G1			G8			C8	G7	G2		A7	G7		C8	C7					G7								G6				G5	
عدنان فارس مزهي العنزي	G7		C7		G5	G2	C8		G8			C9	G7	G3	C9		G7			C6					G7	G1							G6					
علي  حسين عبد المجيد محمد	H3				G6	G2			H1				H2	G3	C7		G8		C9			G3	C6		G8				G2	G4			G7					
عماد محمد محمد عبد التواب	H3				G6	G2			H1			C8	H2	G3	C8		G8	G3			G2				G8		C9		G2				G7					
عمر محمد فضل المولى سعيد	H4				G7	G3	C8		H2		C7		H3	G4			H1	G3			G2				G8				G3				G8		C7			
عمرو محمود عبد الدايم محمد	H4				G7	G3			H2				H3	G4			H1		C9		G2				H1		C8			G4		C9	G8					C8
كريم محمد عبدالهادي	H5				G8	G3			H4				H4	G4	C6		H3	G4		C6	G3				H1					G4		C8	H1					
محمد السيد مصطفى عبد العال	H5	G1	C8		G8	G5			H4	G4			H4	G7	C7		H3	G4		C7					H2								H1					
محمد محمود ابراهيم هلال	H6	G1			H1	G5							H5	G7			H4	G4	C8						H2		C8						H3		C7			C9
محمد مصطفى محمود سلطان	H6	G1			H1	G5			H4				H5	G7			H4	G7	C9		G3				H3			A7					H3					C6
موسي عبدالفتاح موسي حسن	H7	G2			H2	G6	C7		H5		C6	C9	H6	G8	C6		H5	G7							H3								H6					
نداء هزاع نداء الشمرى	H7	G2			H2	G6			H5			C8	H6	G8	C8		H5	G7				G3			H4				G3				H6					
ولاء عطية الدسوقي عسكر	H8	G2			H4	G6			H5				H7	G8			H6				G3	G3			H4				G3				H7	G4			G5	
صلاح علوي حسين الشرفي	H8				H4								H7				H8										C6						H7					
مطارد دخيل ناصر العنزي					H5								H8																									
اياد الناجي					H5		C7						H8																									
احمد بسيوني					H7																										C6							
اداري ا					H7																																	
نهى مرعي 																																						
وفاء فايز												D8																										
رباب صبري																											F9											
وائل العنزي																																			C8			
`;

export const invigilatorData: InvigilatorData[] = rawData
  .trim()
  .split('\n')
  .map(line => {
    const cells = line.split('\t');
    const name = cells[0].trim();
    const schedule: { [key: string]: string } = {};
    headers.forEach((header, index) => {
      const assignment = cells[index + 1] ? cells[index + 1].trim() : '';
      if (assignment) {
        schedule[header] = assignment;
      }
    });
    return { name, schedule };
  })
  .filter(invigilator => invigilator.name); // Filter out any empty lines